src/app/Http/Controllers/PostsController.php

select * from `posts` where `user_id` = 3
---
    public function index()
    {
        //

        $posts=Post::where('user_id',Auth::id())
         ->get();

select * from `posts` where `user_id` = 3 and `id` = '7'
select * from `dates` where `post_id` = '7'
select * from `schedules` where `date_id` = 11
---
    public function show(Request $request, $id)
    {
        // public function show(Request $request, $id)

        // $value = $request->session()->all();
        // $queryParameters = $request->query();
        $id=$request->route('post');

        //

        $posts=Post::where('user_id','=',Auth::id())
         ->where('id', '=', $id)
         ->get();

        $dates=Date::where('post_id','=',$id)
        ->get();
        $schedule=[];
        foreach($dates as $date){
            $schedule[]=Schedule::where('date_id','=',$date->id)
            ->get();

select * from `posts` where `posts`.`id` = '7' limit 1
---
    public function edit($id)
    {
        //
        $post=Post::findOrFail($id);