src/app/Http/Controllers/SchedulesController.php

    public function edit(Request $request)
    {
        //
        $schedule_id=$request->route('schedule');
        $post_id=$request->route('post');
        $date_id=$request->route('date');
        $schedule=Schedule::findOrFail($schedule_id);
---
select * from `schedules` where `schedules`.`id` = '10' limit 1

        function createImagefileName($request,$filenum){
            $imageFile = $request->file('filename_'.$filenum);
        if(!is_null($imageFile)){
        $resizedImage = InterventionImage::make($imageFile)
        ->resize(1920, 1080)->encode();

        $fileName = uniqid(rand().'_');
        $extension = $imageFile->extension();
        $fileNameToPost = $fileName. '.' . $extension;
        Storage::put('public/schedules/' . $fileNameToPost,$resizedImage);
        return $fileNameToPost;
        }elseif(is_null($imageFile)){
        return $fileNameToPost=NULL;
        }
        }
        $fileNameToPost_1=NULL;
        $fileNameToPost_2=NULL;
        $fileNameToPost_3=NULL;
        $fileNameToPost_4=NULL;

        for($i=1;$i<5;$i++){
            $name='fileNameToPost_'.$i;
            $$name=createImagefileName($request,$i);
        }
        $schedule_id=$request->route('schedule');
        $post_id=$request->route('post');


        $schedule=Schedule::findOrFail($schedule_id);
---
select * from `schedules` where `schedules`.`id` = '10' limit 1